DiplomD/src/Documents/ЗачетноЭкзаментационнаяВедомость/ЗачетноЭкзаментационнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетноЭкзаментационнаяВедомость</name>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.РабочаяПрограммаДисцилины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ФормированиеУчебныхГрупп</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаАттестации</name>
    <type>
      <types>EnumRef.АттестационныеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСтудентов</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеЯвка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПромежуточнаяАттестацияПоДисциплине</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийБаллУчебногоРейтинга</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рекомендуемаяОценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Enums/АттестационныеМероприятия/АттестационныеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АттестационныеМероприятия</name>
  <enumValues>
    <name>Зачет</name>
  </enumValues>
  <enumValues>
    <name>Экзамен</name>
  </enumValues>
  <enumValues>
    <name>ДиффЗачет</name>
  </enumValues>
  <enumValues>
    <name>КурсоваяРабота</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Enums/ВидыОценокЗачет/ВидыОценокЗачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОценокЗачет</name>
  <enumValues>
    <name>Зачтено</name>
  </enumValues>
  <enumValues>
    <name>НеЗачтено</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ЗачетнаяКнижкаСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетнаяКнижкаСтудента</name>
  <registerRecords>AccumulationRegister.УспеваемостьСтудентов</registerRecords>
  <registerRecords>AccumulationRegister.Сессия</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАттестационныхДисцилин</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перезачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийСеместровыйРейтинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ФормированиеУчебныхГрупп/ФормированиеУчебныхГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеУчебныхГрупп</name>
  <attributes>
    <name>НомерГруппы</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСтудентов</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчислен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбучения</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАттестации</name>
      <type>
        <types>EnumRef.АттестационныеМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/Группы/Группы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Группы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодНачалаОбучения</name>
    <type>
      <types>EnumRef.ГодНачалаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Catalogs/Кафедры/Кафедры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кафедры</name>
  <attributes>
    <name>НомерКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведующийКафедрой</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМетодист</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПреподавательскийСостав</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПреподавателя</name>
      <type>
        <types>CatalogRef.ДолжностиПреподавательскогоСостава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрофилиНаправления</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ПрофилиНаправления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DiplomD/src/Documents/ЗачетноЭкзаментационнаяВедомость/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		Для каждого стр из Объект.СписокСтудентов Цикл   
		
		Док = Документы.ЗачетнаяКнижкаСтудента.НайтиПоРеквизиту("Студент",Стр.Студент).ПолучитьОбъект();
		Парам = Новый Структура; 
		Парам.Вставить("Дисциплина",Объект.Дисциплина); 
		парам.Вставить("Семестр",Объект.Семестр); 
		НС = Док.СписокАттестационныхДисцилин.НайтиСтроки(Парам); 
		Если НС.Количество() = 0 Тогда
			 О = Док.СписокАттестационныхДисцилин.Добавить(); 
			 О.Дисциплина = Объект.Дисциплина; 
			 О.Семестр = Объект.Семестр; 
			 О.КоличествоЧасов = Объект.КоличествоЧасов; 
			 О.Оценка = Стр.Оценка; 
			 О.Преподаватель = Объект.Преподаватель; 
		Док.Записать(РежимЗаписиДокумента.Запись); 
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЕсли; 
		
		
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок = ПечатьНаСервере(); 
	табДок.Показать();
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере() 
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Документы.ЗачетноЭкзаментационнаяВедомость.ПолучитьМакет("Макет"); 
	
	Областьшапка= Макет.ПолучитьОбласть("шапка"); 
	
	Областьшапка.Параметры.Ном = объект.Номер; 
	ТабДок.Вывести(Областьшапка); 
	
	Шапка2 = Макет.ПолучитьОбласть("Шапка2"); 
	
	Шапка2.Параметры.Экзаменатор = Объект.Преподаватель; 
	  Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа); 
	 Запрос = Новый Запрос; 
	 Запрос.Текст = "ВЫБРАТЬ
	                |	КафедрыПрофилиНаправления.Ссылка.Факультет КАК Факультет,
	                |	КафедрыПрофилиНаправления.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.Кафедры.ПрофилиНаправления КАК КафедрыПрофилиНаправления
	                |ГДЕ
	                |	КафедрыПрофилиНаправления.Профиль = &Профиль"; 
	 Запрос.УстановитьПараметр("Профиль",Спр.ПрофильНаправления); 
	 Рез = Запрос.Выполнить().Выбрать(); 
	 рез.Следующий(); 
	 
	Шапка2.Параметры.Факультет = Рез.Факультет; 
	Док2 = Документы.ФормированиеУчебныхГрупп.НайтиПоРеквизиту("НомерГруппы",Объект.Группа); 
	Шапка2.Параметры.Курс = Док2.Курс; 
	Шапка2.Параметры.Сем = Объект.Семестр; 
	Шапка2.Параметры.Груп = Объект.Группа; 
	Шапка2.Параметры.Специальность = Спр.ПрофильНаправления; 
	Шапка2.Параметры.ФормОб = Док2.ФормаОбучения; 
	Шапка2.Параметры.Дисциплина = Объект.Дисциплина; 
	Шапка2.Параметры.КолЧас = Объект.КоличествоЧасов;
	Шапка2.Параметры.Дат = Объект.Дата; 
	Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.Экзамен Тогда 
		
	Шапка2.Параметры.ОтмЭ = "v";  
Конецесли; 
  	Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.КурсоваяРабота Тогда 
		
	Шапка2.Параметры.ОтмК = "v";  
Конецесли; 
	Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.Зачет Тогда 
		
	Шапка2.Параметры.ОтмЗ = "v";  
Конецесли;	
Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.ДиффЗачет Тогда 
		
	Шапка2.Параметры.ОтмДифф = "v";  
Конецесли;

ТабДок.Вывести(Шапка2); 

ШапкаТабл = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
Табдок.Вывести(ШапкаТабл);  

Табл = Макет.ПолучитьОбласть("ТаблицаСтудентов");
Ном = 0; 

Для каждого стр из Объект.СписокСтудентов Цикл 
	Ном = Ном +1; 
	Табл.Параметры.НомСт = Ном;  
	Табл.Параметры.ФИОСтудент = Стр.Студент; 
	Табл.Параметры.НомЗачетки = Стр.НомерЗачетнойКнижки; 
	Если Стр.НеЯвка = Истина Тогда 
	Табл.Параметры.НЯ = "v"; 
КонецЕсли; 
Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.Зачет Тогда 
	  Табл.Параметры.Оценка = Стр.Оценка; 
  Иначе 
	  Если Стр.Оценка = 5 Тогда 
		Табл.Параметры.Пять = "v";
	КонецЕсли; 
     Если Стр.Оценка = 4 Тогда 
		Табл.Параметры.Четыр = "v";
	КонецЕсли;
	 Если Стр.Оценка = 3 Тогда 
		Табл.Параметры.Три = "v";
	КонецЕсли;
	 Если Стр.Оценка = 2 Тогда 
		Табл.Параметры.Два = "v";
	КонецЕсли;
КонецЕсли;

ТабДок.Вывести(Табл); 
  
	
	
КонецЦикла;

Подпись = макет.ПолучитьОбласть("Подпись"); 
Табдок.Вывести(Подпись); 

Подвал = макет.ПолучитьОбласть("Подвал"); 

Подвал.Параметры.Всего = Ном; 
 Оценка5 = 0; 
	  Оценка4 = 0;
	  Оценка3 = 0;
	 Оценка2 = 0;
	 Зачет = 0; 
	 Незачет = 0; 
	 Неявка = 0; 
 
	 Для каждого строка из Объект.СписокСтудентов Цикл
	     Если Строка.Оценка = перечисления.ВидыОценокЗачет.Зачтено Тогда 
	    	 Зачет = Зачет +1; 
	     КонецЕсли; 
	     Если Строка.Оценка = перечисления.ВидыОценокЗачет.НеЗачтено Тогда 
	    	 Незачет = Незачет +1; 
	    КонецЕсли; 
	    Если Строка.Оценка = 5 Тогда 
	    	 Оценка5 = Оценка5 +1; 
	    КонецЕсли;
	    Если Строка.Оценка = 4 Тогда 
	    	 Оценка4 = Оценка4 +1; 
	     КонецЕсли;
	     Если Строка.Оценка = 3 Тогда 
	    	 Оценка3 = Оценка3 +1; 
	     КонецЕсли;
	      Если Строка.Оценка = 2 Тогда 
	    	 Оценка2 = Оценка2 +1; 
	     КонецЕсли;
	     Если Строка.НеЯвка = Истина Тогда 
	    	 Неявка = неявка +1; 
	     КонецЕсли; 
	      
	 КонецЦикла; 
	 
 
	 Подвал.Параметры.Отл = Оценка5; 
	 Подвал.Параметры.Хор = Оценка4; 
	 Подвал.Параметры.Удв = оценка3; 
	 Подвал.Параметры.НеУдв = оценка2; 
	 Подвал.Параметры.Зачет = Зачет; 
	 Подвал.Параметры.НеЗачет = Незачет; 
	 Подвал.Параметры.НеЯвка = Неявка; 
	
	 
	 табДок.Вывести(подвал); 
	 
	Возврат табДок; 
	 







	
КонецФункции


&НаСервере
Процедура ПриОткрытииНаСервере() 
 	Если Объект.Выдана = Ложь Тогда 
		ЭтаФорма.Элементы.СписокСтудентов.Доступность = Ложь; 
	КонецЕсли; 
	
	
КонецПроцедуры
